<?php

$clientA = new \Hprose\Http\Client(MY_HTTP_HOST,false);
$objCode = json_decode($clientA->getCodeDetail());
$host = $_SERVER['HTTP_HOST'];

$ip = CommonClass::get_user_ip();

//测试暂用ip地址
//$ip = '127.0.0.3';
$config = $clientA->getSiteSet(SITE_ID);

if (isset($config['api_config'])) {
    foreach ($config['api_config'] as $k => $v) {
        if ($k != 'SITE_ID') {
            define($k, $v);
        }
    }
} else {
    echo "网络错误111";
    exit();
}
$action = filter_input(INPUT_GET, 'action');
$json = filter_input(INPUT_GET, 'json');
$jsonpcallback = filter_input(INPUT_GET, 'callback');
$jsonp = $json ? $json : 'json';

$add_money_code = array(
    '10001' => '公司入款',
    '10002' => '公司入款优惠',
    '10003' => '公司汇款优惠',
    '10004' => '返点',
    '10005' => '线上存款',
    '10006' => '线上存款手续费',
    '10007' => '线上存款优惠',
    '10008' => '人工存入',
    '10010' => '系统取消出款',
    '10011' => '人工存入,取消出款',
    '10012' => '重复出款',
    '10015' => '给予反水',
    '10016' => '存款优惠',
    '10017' => '汇款优惠',
    '10018' => '退佣优惠',
    '10019' => '负数额度归零',
    '10020' => '重覆出款',                  //入款
    '10021' => '其他人工存入',
    '10025' => '会员负数回冲',
    '10028' => '系统-新增快开额度',
    '10029' => '活动优惠',
    '10030' => '返点优惠',
    '10035' => '球类返点',
    '10036' => '视讯返点',
    '10037' => '体育返点',
    '10038' => '机率返点',
    '10039' => '彩票返点',
    '10045' => '佣金返还',
    '10048' => '会员返水',
    '10050' => '信用存入',
    '10052' => '推广好友优惠',
    '10053' => '现金存入',

    '10060' => '代理返水',
    '10062' => '总代理返水',
    '10064' => '股东返水',
    '10066' => '大股东返水',

    '60000' => '代理平台转入',
);

$reduce_money_code = array(
    '10013' => '沖銷',                     //会员反水错误，扣除反水金额
    '10014' => '会员出款被扣除金额',

    '10022' => '手动申请出款',
    '10023' => '放弃存款优惠',
    '10024' => '公司入款误存',
    '10026' => '扣除非法下注派彩',
    '10027' => '其他人工提出',
    '10033' => '手续费扣除',
    '10034' => '优惠金额扣除',
    '10040' => '球类冲销',
    '10041' => '视讯冲销',
    '10042' => '体育冲销',
    '10043' => '机率冲销',
    '10044' => '彩票冲销',
    '10046' => '佣金注销',
    '10047' => '奖金提取',
    '10049' => '除去会员返水',
    '10051' => '信用提出',
    '10054' => '现金提出',

    '10061' => '除去代理返水',
    '10063' => '除去总代理返水',
    '10065' => '除去股东返水',
    '10067' => '除去大股东返水',

    '60001' => '代理平台转出'
);

$zhuang_zhang_code = array(

    '20001' => '主账户转至AG',
    '20002' => '主账户转至BB',
    '20003' => '主账户转至PT',
    '20004' => '主账户转至MG',
    '20005' => '主账户转至GG',
    '20006' => '主账户转至SA',
    '20007' => '由AG转入主账户',
    '20008' => '由BB转入主账户',
    '20009' => '由PT转入主账户',
    '20010' => '由MG转入主账户',
    '20011' => '由GG转入主账户',
    '20012' => '由SA转入主账户',
    '20013' => '主账户转至AG失败-返还',
    '20014' => '主账户转至BB失败-返还',
    '20015' => '主账户转至PT失败-返还',
    '20016' => '主账户转至MG失败-返还',
    '20017' => '主账户转至GG失败-返还',
    '20018' => '主账户转至SA失败-返还',

);

$touzhu_code = array(


    '30001' => 'AG投注',
    '30002' => 'BB投注',
    '30003' => 'PT投注',
    '30004' => 'MG投注',
    '30005' => 'GG投注',
    '30006' => 'SA投注',
    '30007' => 'AG派彩',
    '30008' => 'BB派彩',
    '30009' => 'PT派彩',
    '30010' => 'MG派彩',
    '30011' => 'GG派彩',
    '30012' => 'SA派彩',
);

$formKeyType = array(
    '10001' => '公司入款',
    '10002' => '公司入款优惠',
    '10003' => '公司汇款优惠',
    '10004' => '返点',
    '10005' => '线上存款',
    '10006' => '线上存款手续费',
    '10007' => '线上存款优惠',
    '10008' => '人工存入',
    '10009' => '出款',
    '10010' => '系统取消出款',
    '10011' => '人工存入取消出款',
    '10012' => '重复出款',
    '10013' => '沖銷',                     //会员反水错误，扣除反水金额
    '10014' => '会员出款被扣除金额',
    '10015' => '给予反水',
    '10016' => '存款优惠',
    '10017' => '汇款优惠',
    '10018' => '退佣优惠',
    '10019' => '负数额度归零',
    '10020' => '重覆出款',                  //入款
    '10021' => '其他人工存入',
    '10022' => '手动申请出款',
    '10023' => '放弃存款优惠',
    '10024' => '公司入款误存',
    '10025' => '会员负数回冲',
    '10026' => '扣除非法下注派彩',
    '10027' => '其他人工提出',
    '10028' => '系统-新增快开额度',
    '10029' => '活动优惠',
    '10030' => '返点优惠',
    '10031' => '回复删单',
    '10032' => '删单',
    '10033' => '手续费扣除',
    '10034' => '优惠金额扣除',
    '10035' => '球类返点',
    '10036' => '视讯返点',
    '10037' => '体育返点',
    '10038' => '机率返点',
    '10039' => '彩票返点',
    '10040' => '球类冲销',
    '10041' => '视讯冲销',
    '10042' => '体育冲销',
    '10043' => '机率冲销',
    '10044' => '彩票冲销',
    '10045' => '佣金返还',
    '10046' => '佣金注销',
    '10047' => '奖金提取',
    '10048' => '会员返水',
    '10049' => '除去会员返水',
    '10050' => '信用存入',
    '10051' => '信用提出',
    '10052' => '推广好友优惠',
    '10053' => '现金存入',
    '10054' => '现金提出',
    
    '10060' => '代理返水',
    '10061' => '除去代理返水',
    '10062' => '总代理返水',
    '10063' => '除去总代理返水',
    '10064' => '股东返水',
    '10065' => '除去股东返水',
    '10066' => '大股东返水',
    '10067' => '除去大股东返水',
    
    
    '20001' => '主账户转至AG',
    '20002' => '主账户转至BB',
    '20003' => '主账户转至PT',
    '20004' => '主账户转至MG',
    '20005' => '主账户转至GG',
    '20006' => '主账户转至SA',
    '20007' => '由AG转入主账户',
    '20008' => '由BB转入主账户',
    '20009' => '由PT转入主账户',
    '20010' => '由MG转入主账户',
    '20011' => '由GG转入主账户',
    '20012' => '由SA转入主账户',
    '20013' => '主账户转至AG失败-返还',
    '20014' => '主账户转至BB失败-返还',
    '20015' => '主账户转至PT失败-返还',
    '20016' => '主账户转至MG失败-返还',
    '20017' => '主账户转至GG失败-返还',
    '20018' => '主账户转至SA失败-返还',
    
    
    '30001' => 'AG投注',
    '30002' => 'BB投注',
    '30003' => 'PT投注',
    '30004' => 'MG投注',
    '30005' => 'GG投注',
    '30006' => 'SA投注',
    '30007' => 'AG派彩',
    '30008' => 'BB派彩',
    '30009' => 'PT派彩',
    '30010' => 'MG派彩',
    '30011' => 'GG派彩',
    '30012' => 'SA派彩',
    
    
    '60000' => '代理平台转入',
    '60001' => '代理平台转出'
);


